package homeworks_1;

//Реализовать программу, которая выводит числа в консоль в указанном диапазоне, т.е. программа принимает
// два числа - начало диапазона и конец.
public class Realiz_try_zad {
    public static void main(String[] args) {
        int Per_a = 15;
        int Per_b = 79;
        int result_X;
        for (result_X = Per_a; result_X <= Per_b; result_X++) {
            System.out.println(result_X);
        }
            System.out.println("Диапазон расчитан");

            }
        }










